{
  "navbar": {
    "title": "Портфоліо",
    "home": "Головна",
    "experience": "Досвід",
    "projects": "Проекти",
    "about": "Про мене",
    "contact": "Контакти"
  },

  "home": {
    "profilePhotoAlt": "Фото профілю",
    "welcomeMessage": "Ласкаво просимо на мій сайт-портфоліо!",
    "introduction": "Привіт, я Себастьян, змінив кар'єру і захоплений Full-Stack веб-розробник. Це мій сайт-портфоліо, де я не тільки демонструю свої технічні та м'які навички, але й ділюся трохи про себе. Моя мета - дати потенційним роботодавцям перше враження як про мої навички, так і про мою особистість. Не соромтеся досліджувати мої проекти, дізнаватися більше про мою подорож і не вагайтеся зв'язатися, якщо хочете поспілкуватися!"
  },

  "experience": {
    "whatIDo": "Що я роблю",
    "mySkillset": "Мої навички",
    "frontendDevelopment": "Frontend розробка",
    "frontendDescription": "Я створюю веб-сайти та веб-додатки, використовуючи сучасні технології, такі як React, ThreeJS та Tailwind CSS.",
    "backendDevelopment": "Backend розробка",
    "backendDescription": "Я розробляю серверні додатки, використовуючи Node.js, Express, PostgreSQL та MongoDB.",
    "webDesign": "Веб-дизайн",
    "webDesignDescription": "Я розробляю веб-сайти та веб-додатки, які зручні для користувача та візуально привабливі.",
    "developmentSkills": "Навички розробки",
    "developmentSkillsDescription": "Як розробник стека MERN та PERN з глибоким розумінням архітектури backend, я створюю динамічні, масштабовані веб-додатки. Мій фокус - створення безшовного користувацького досвіду з високою продуктивністю та ефективністю, використовуючи сучасні технології для надання надійних full-stack рішень.",
    "webDesignSkills": "Навички веб-дизайну",
    "webDesignSkillsDescription": "Як Full-Stack веб-розробник, мій основний фокус - створення функціональних та ефективних додатків. Хоча я не вважаю себе професійним веб-дизайнером, я працював з різними інструментами та технологіями дизайну для створення візуально привабливих та зручних інтерфейсів. Деякі з інструментів, з якими у мене є досвід, включають:",
    "technicalSkills": "Технічні навички та інструменти",
    "technicalSkillsDescription": "Як Full-Stack веб-розробник, я працюю з різними інструментами та технологіями для створення, розгортання та підтримки додатків. Мої навички виходять за рамки кодування — у мене також є досвід в адмініструванні систем, робочих процесах розробки та гнучких методологіях. З цими навичками я забезпечую плавні розгортання, ефективні процеси розробки та добре керовані системи. Я процвітаю в гнучких середовищах і постійно шукаю способи оптимізації робочих процесів та співпраці. Ось деякі з ключових технологій та практик, які я використовую:",
    "skillsInProgress": "Навички в процесі розвитку",
    "skillsInProgressDescription": "Як розробник, я завжди прагну розширювати свої знання та досліджувати нові технології. Наразі я зосереджений на покращенні своїх навичок у наступних областях:"
  },

  "projects": {
    "title": "Мої проекти",
    "description": "На цій сторінці я демонструю проекти, над якими працював під час мого bootcamp з розробки. Більшість цих проектів були створені всього за один тиждень, за винятком Inclusive Trip, який був моїм фінальним проектом, де я розробляв як frontend, так і backend. Ці проекти знаходяться на початковому рівні, але вони демонструють, скільки я навчився всього за чотири місяці і як швидко я прогресував як розробник. Кожен проект відображає мою здатність застосовувати нові концепції, працювати в умовах обмеженого часу та постійно покращувати свої навички.",
    "inclusiveTripFrontend": "Frontend Inclusive Trip",
    "inclusiveTripBackend": "Backend Inclusive Trip",
    "pokemonGameFrontend": "Frontend гри Pokemon",
    "pokemonGameBackend": "Backend гри Pokemon",
    "eCommerceAPI": "API для електронної комерції",
    "movieDiary": "Щоденник фільмів",
    "redirectTitle": "Перенаправлення на проект",
    "redirectMessage": "Ви намагаєтеся відкрити наступний проект:",
    "backButton": "Назад",
    "okButton": "OK"
  },

  "about": {
    "title": "Від вітряних турбін до веб-розробки – Моя подорож",
    "description": "Привіт! Я Себастьян – ентузіаст IT, самопроголошений техногік і людина, яка любить хороші виклики. Моя подорож у веб-розробку не була прямою. Насправді, до того як я почав кодувати, я провів роки, працюючи в області забезпечення якості, електроніки та IT-підтримки – і навіть мав короткий досвід вивчення морських наук (так, кораблі!). Але одне завжди було ясно: у мене є пристрасть до технологій і вирішення проблем. Будь то відладка коду, усунення неполадок обладнання або з'ясування, як змусити мого кота перестати красти моє крісло – я люблю знаходити рішення. Крім технологій, я соціальна і допитлива людина, яка любить подорожувати, грати в ігри та займатися спортом. Ви можете знайти мене, коли я граю в баскетбол, плаваю або займаюся проектами DIY, коли я не занурений у код. Я процвітаю в командних середовищах, вірю в навчання протягом усього життя і завжди прагну приносити позитивне і відкритий настрій, куди б я не пішов. Тож, якщо ви шукаєте мотивованого, адаптованого і веселого командного гравця, який прагне до зростання, давайте зв'яжемося!"
  },

  "contact": {
    "title": "Давайте зв'яжемося!",
    "subtitle": "Є питання або хочете попрацювати разом? Не соромтеся зв'язатися!",
    "firstName": "Ім'я",
    "lastName": "Прізвище",
    "email": "Електронна пошта",
    "phone": "Телефон",
    "message": "Повідомлення",
    "discuss": "Про що ви хочете поговорити?",
    "jobOpportunities": "Вакансії",
    "buildSomething": "У мене є ідея — давайте створимо щось дивовижне!",
    "shareIdeas": "Давайте зв'яжемося і поділимося ідеями!",
    "somethingElse": "Щось інше? Дайте мені знати!",
    "requestResume": "Я хотів би отримати копію вашого резюме",
    "sending": "Надсилання...",
    "submit": "Надіслати",
    "errorFillFields": "Будь ласка, заповніть усі обов'язкові поля.",
    "errorSelectTopic": "Будь ласка, виберіть принаймні одну тему.",
    "errorCaptcha": "Будь ласка, завершіть перевірку reCAPTCHA.",
    "successMessage": "Ваше повідомлення успішно надіслано! Я скоро зв'яжуся з вами.",
    "errorSendMessage": "Не вдалося надіслати повідомлення. Будь ласка, спробуйте ще раз.",
    "errorNetwork": "Помилка мережі. Будь ласка, перевірте ваше з'єднання і спробуйте знову."
  }
}
