{
  "navbar": {
    "title": "Портфолио",
    "home": "Главная",
    "experience": "Опыт",
    "projects": "Проекты",
    "about": "Обо мне",
    "contact": "Контакты"
  },

  "home": {
    "profilePhotoAlt": "Фото профиля",
    "welcomeMessage": "Добро пожаловать на мой сайт-портфолио!",
    "introduction": "Привет, я Себастьян, сменивший карьеру и увлеченный Full-Stack веб-разработчик. Это мой сайт-портфолио, где я не только демонстрирую свои технические и мягкие навыки, но и делюсь немного о себе. Моя цель - дать потенциальным работодателям первое впечатление как о моих навыках, так и о моей личности. Не стесняйтесь исследовать мои проекты, узнать больше о моем пути и не стесняйтесь связаться, если хотите пообщаться!"
  },

  "experience": {
    "whatIDo": "Чем я занимаюсь",
    "mySkillset": "Мои навыки",
    "frontendDevelopment": "Frontend разработка",
    "frontendDescription": "Я создаю веб-сайты и веб-приложения, используя современные технологии, такие как React, ThreeJS и Tailwind CSS.",
    "backendDevelopment": "Backend разработка",
    "backendDescription": "Я разрабатываю серверные приложения, используя Node.js, Express, PostgreSQL и MongoDB.",
    "webDesign": "Веб-дизайн",
    "webDesignDescription": "Я разрабатываю веб-сайты и веб-приложения, которые удобны для пользователя и визуально привлекательны.",
    "developmentSkills": "Навыки разработки",
    "developmentSkillsDescription": "Как разработчик стека MERN и PERN с глубоким пониманием архитектуры backend, я создаю динамичные, масштабируемые веб-приложения. Мой фокус - создание бесшовного пользовательского опыта с высокой производительностью и эффективностью, используя современные технологии для предоставления надежных full-stack решений.",
    "webDesignSkills": "Навыки веб-дизайна",
    "webDesignSkillsDescription": "Как Full-Stack веб-разработчик, мой основной фокус - создание функциональных и эффективных приложений. Хотя я не считаю себя профессиональным веб-дизайнером, я работал с различными инструментами и технологиями дизайна для создания визуально привлекательных и удобных интерфейсов. Некоторые из инструментов, с которыми у меня есть опыт, включают:",
    "technicalSkills": "Технические навыки и инструменты",
    "technicalSkillsDescription": "Как Full-Stack веб-разработчик, я работаю с различными инструментами и технологиями для создания, развертывания и поддержки приложений. Мои навыки выходят за рамки кодирования — у меня также есть опыт в администрировании систем, рабочих процессах разработки и гибких методологиях. С этими навыками я обеспечиваю плавные развертывания, эффективные процессы разработки и хорошо управляемые системы. Я процветаю в гибких средах и постоянно ищу способы оптимизации рабочих процессов и сотрудничества. Вот некоторые из ключевых технологий и практик, которые я использую:",
    "skillsInProgress": "Навыки в процессе развития",
    "skillsInProgressDescription": "Как разработчик, я всегда стремлюсь расширять свои знания и исследовать новые технологии. В настоящее время я сосредоточен на улучшении своих навыков в следующих областях:"
  },

  "projects": {
    "title": "Мои проекты",
    "description": "На этой странице я демонстрирую проекты, над которыми работал во время моего bootcamp по разработке. Большинство этих проектов были созданы всего за одну неделю, за исключением Inclusive Trip, который был моим финальным проектом, где я разрабатывал как frontend, так и backend. Эти проекты находятся на начальном уровне, но они демонстрируют, сколько я узнал всего за четыре месяца и как быстро я прогрессировал как разработчик. Каждый проект отражает мою способность применять новые концепции, работать в условиях ограниченного времени и постоянно улучшать свои навыки.",
    "inclusiveTripFrontend": "Frontend Inclusive Trip",
    "inclusiveTripBackend": "Backend Inclusive Trip",
    "pokemonGameFrontend": "Frontend игры Pokemon",
    "pokemonGameBackend": "Backend игры Pokemon",
    "eCommerceAPI": "API для электронной коммерции",
    "movieDiary": "Дневник фильмов",
    "redirectTitle": "Перенаправление на проект",
    "redirectMessage": "Вы пытаетесь открыть следующий проект:",
    "backButton": "Назад",
    "okButton": "OK",
    "swipeHint": "Svep åt vänster eller höger för att se fler projekt."
  },

  "about": {
    "title": "От ветряных турбин до веб-разработки – Моя история",
    "description": "Привет! Я Себастьян – энтузиаст IT, самопровозглашенный техногик и человек, который любит хорошие вызовы. Мой путь в веб-разработку не был прямым. На самом деле, до того как я начал кодировать, я провел годы, работая в области обеспечения качества, электроники и IT-поддержки – и даже имел краткий опыт изучения морских наук (да, корабли!). Но одно всегда было ясно: у меня есть страсть к технологиям и решению проблем. Будь то отладка кода, устранение неполадок оборудования или выяснение, как заставить моего кота перестать красть мое кресло – я люблю находить решения. Помимо технологий, я общительный и любознательный человек, который любит путешествовать, играть в игры и заниматься спортом. Вы можете найти меня играющим в баскетбол, плавающим или возящимся с проектами DIY, когда я не погружен в код. Я процветаю в командных средах, верю в обучение на протяжении всей жизни и всегда стремлюсь приносить позитивное и открытое отношение, куда бы я ни пошел. Так что, если вы ищете мотивированного, адаптируемого и веселого командного игрока, который стремится к росту, давайте свяжемся!"
  },

  "contact": {
    "title": "Давайте свяжемся!",
    "subtitle": "Есть вопросы или хотите поработать вместе? Не стесняйтесь связаться!",
    "firstName": "Имя",
    "lastName": "Фамилия",
    "email": "Электронная почта",
    "phone": "Телефон",
    "message": "Сообщение",
    "discuss": "О чем вы хотите поговорить?",
    "jobOpportunities": "Вакансии",
    "buildSomething": "У меня есть идея — давайте создадим что-то потрясающее!",
    "shareIdeas": "Давайте свяжемся и поделимся идеями!",
    "somethingElse": "Что-то еще? Дайте мне знать!",
    "requestResume": "Я хотел бы получить копию вашего резюме",
    "sending": "Отправка...",
    "submit": "Отправить",
    "errorFillFields": "Пожалуйста, заполните все обязательные поля.",
    "errorSelectTopic": "Пожалуйста, выберите хотя бы одну тему.",
    "errorCaptcha": "Пожалуйста, завершите проверку reCAPTCHA.",
    "successMessage": "Ваше сообщение успешно отправлено! Я скоро свяжусь с вами.",
    "errorSendMessage": "Не удалось отправить сообщение. Пожалуйста, попробуйте еще раз.",
    "errorNetwork": "Ошибка сети. Пожалуйста, проверьте ваше соединение и попробуйте снова."
  }
}
